# Take imdb dataframe set to ssd, sample it and split it into train, test and validation data

In [14]:
import os, sys
os.chdir(sys.path[1])

In [15]:
import pandas as pd
from data_generator.dataset_generator import *

In [16]:
attr = 'age'

In [17]:
df = pd.read_csv('/home/nicoli/github/ssd_keras/dataset/csv/imdb_csv/imdb_'+ attr + '.csv', index_col=0)
df.head()

,image_name,xmin,xmax,ymin,ymax,class_id
0,imdb/01/nm0000001_rm124825600_1899-5-10_1968.jpg,1072.926000,1214.784000,161.838000,303.696000,69
1,imdb/01/nm0000001_rm3343756032_1899-5-10_1970.jpg,477.184000,622.592000,100.352000,245.760000,71
2,imdb/01/nm0000001_rm577153792_1899-5-10_1968.jpg,114.969643,451.686572,114.969643,451.686572,69
3,imdb/01/nm0000001_rm946909184_1899-5-10_1968.jpg,622.885506,844.339008,424.217504,645.671006,69
4,imdb/01/nm0000001_rm980463616_1899-5-10_1968.jpg,1013.859002,1201.586128,233.882042,421.609168,69

In [18]:
df[['xmin', 'xmax', 'ymin', 'ymax']] = df[['xmin', 'xmax', 'ymin', 'ymax']].astype(int)

In [19]:
qtd = 10000
train_split, val_split, test_split = (0.7,0.1,0.2)
#classes = [[0,1],[1,0]]
target = ['class_id']#['class_id1', 'class_id2']

In [20]:
train_df, val_df, test_df = set_age_data_splits(df, qtd, train_split, val_split, test_split, target)

In [21]:
train_df.head()

,image_name,xmin,xmax,ymin,ymax,class_id
0,imdb/01/nm0000001_rm124825600_1899-5-10_1968.jpg,1072,1214,161,303,69
1,imdb/01/nm0000001_rm3343756032_1899-5-10_1970.jpg,477,622,100,245,71
2,imdb/01/nm0000001_rm577153792_1899-5-10_1968.jpg,114,451,114,451,69
3,imdb/01/nm0000001_rm946909184_1899-5-10_1968.jpg,622,844,424,645,69
4,imdb/01/nm0000001_rm980463616_1899-5-10_1968.jpg,1013,1201,233,421,69

In [22]:
val_df.head()

,image_name,xmin,xmax,ymin,ymax,class_id
273823,imdb/22/nm0644022_rm1681112320_1962-10-22_2008...,1212,1599,174,562,46
273824,imdb/22/nm0644022_rm1775819520_1962-10-22_2008...,486,1210,566,1290,46
273825,imdb/22/nm0644022_rm182897664_1962-10-22_2014.jpg,60,126,23,89,52
273826,imdb/22/nm0644022_rm1882184960_1962-10-22_2013...,1564,1720,230,386,51
273827,imdb/22/nm0644022_rm199674880_1962-10-22_2014.jpg,42,104,56,118,52

In [23]:
test_df.head()

,image_name,xmin,xmax,ymin,ymax,class_id
312947,imdb/99/nm0268199_rm2399314688_1976-5-31_2013.jpg,792,948,423,579,37
312948,imdb/99/nm0268199_rm2401343488_1976-5-31_2002.jpg,208,254,156,202,26
312949,imdb/99/nm0268199_rm2402719744_1976-5-31_2003.jpg,308,378,55,126,27
312950,imdb/99/nm0268199_rm2424873728_1976-5-31_2013.jpg,607,799,283,475,37
312951,imdb/99/nm0268199_rm2458428160_1976-5-31_2013.jpg,1292,1654,244,605,37

In [24]:
titulo = str(qtd) + '-' + str(int(100*train_split)) + '-' + str(int(100*val_split)) + '-' + str(int(100*20))
titulo

'10000-70-10-2000'

In [25]:

train_df.to_csv('/home/nicoli/github/ssd_keras/dataset/csv/imdb_csv/imdb_' + attr + '_train_split_' + titulo + '.csv', index=False)
val_df.to_csv('/home/nicoli/github/ssd_keras/dataset/csv/imdb_csv/imdb_' + attr + '_val_split_' + titulo + '.csv',index=False)
test_df.to_csv('/home/nicoli/github/ssd_keras/dataset/csv/imdb_csv/imdb_' + attr + '_test_split_' + titulo + '.csv',index=False)

In [26]:
train_df.isnull().sum()

image_name    0
xmin          0
xmax          0
ymin          0
ymax          0
class_id      0
dtype: int64